Revit 2017 API
IndependentTag Class
 Represents an IndependentTag within Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class IndependentTag : Element
Visual Basic
Public Class IndependentTag _
	Inherits Element
Visual C++
public ref class IndependentTag : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.IndependentTag
 Autodesk.Revit.DB.Structure.FabricReinSpanSymbol
 Autodesk.Revit.DB.Structure.PathReinSpanSymbol
 Autodesk.Revit.DB.Structure.RebarSystemSpanSymbol
See Also
IndependentTag Members
Autodesk.Revit.DB Namespace